#include "Framework.h"
#include <Windows.h>


/// -------------------------------------------------------------
///				　		ゲーム全体の実行処理
/// -------------------------------------------------------------
void Framework::Run()
{
	// 初期化処理
	Initialize();

	// ゲームループ
	while (!IsEndRequest())// 終了リクエストが来たら抜ける
	{
		// 毎フレーム更新
		Update();

		// 描画
		Draw();
	}

	// ゲームの終了
	Finalize();
}


/// -------------------------------------------------------------
///				　　 　ゲーム全体の初期化処理
/// -------------------------------------------------------------
void Framework::Initialize()
{
	// シーンマネージャーの生成
	//sceneManager_ = std::make_unique<SceneManager>();
}


/// -------------------------------------------------------------
///				　		ゲーム全体の更新処理
/// -------------------------------------------------------------
void Framework::Update()
{
	// シーンマネージャーの更新処理
	//sceneManager_->Update();

}


/// -------------------------------------------------------------
///				　		ゲーム全体の終了処理
/// -------------------------------------------------------------
void Framework::Finalize()
{
	// シーンマネージャーの解放
	//sceneManager_.reset();

	// その他の終了処理

}

