#include "MenuState.h"


/// -------------------------------------------------------------
///					メニュー画面の初期化処理
/// -------------------------------------------------------------
void MenuState::Initialize()
{
	OutputDebugStringA("Entering Menu State\n");
}


/// -------------------------------------------------------------
///					メニュー画面の更新処理
/// -------------------------------------------------------------
void MenuState::Update()
{
	OutputDebugStringA("Updating Menu State\n");
}


/// -------------------------------------------------------------
///					メニュー画面の描画処理
/// -------------------------------------------------------------
void MenuState::Draw()
{
	OutputDebugStringA("Rendering Menu State\n");
}


/// -------------------------------------------------------------
///					メニュー画面の終了処理
/// -------------------------------------------------------------
void MenuState::Exit()
{
	OutputDebugStringA("Exiting Menu State\n");
}
