#include "Player.h"
#include "ParameterManager.h"


/// -------------------------------------------------------------
///					　		初期化処理
/// -------------------------------------------------------------
void Player::Initialize()
{
	// プレイヤーオブジェクトの生成と初期化
	player_ = std::make_unique<Object3D>();
	player_->Initialize("cube.gltf");
}


/// -------------------------------------------------------------
///					　		 更新処理
/// -------------------------------------------------------------
void Player::Update()
{
	// プレイヤープジェクトの更新
	player_->Update();
}


/// -------------------------------------------------------------
///					　		 描画処理
/// -------------------------------------------------------------
void Player::Draw()
{
	// プレイヤーオブジェクトの描画
	player_->Draw();
}
