#include "SceneManager.h"



/// -------------------------------------------------------------
///					　		デストラクタ
/// -------------------------------------------------------------
SceneManager::~SceneManager()
{
	// 最後のシーンの終了と解放
	scene_->Finalize();
	delete scene_;
}


/// -------------------------------------------------------------
///						　	更新処理
/// -------------------------------------------------------------
void SceneManager::Update()
{
	// TODO: シーン切り替え機構

	// 次のシーンの予約があるなら
	if (nextScene_)
	{
		// 旧シーンの終了
		if (scene_)
		{
			scene_->Finalize();
			delete scene_;
		}

		// シーン切り替え
		scene_ = nextScene_;
		nextScene_ = nullptr;
		// 次のシーンを初期化する
	}

	// 実行中のシーンを更新する
	scene_->Update();
}



/// -------------------------------------------------------------
///					　		描画処理
/// -------------------------------------------------------------
void SceneManager::Draw()
{
	scene_->Draw();
}
