#include "Collider.h"
#include "Wireframe.h"


/// -------------------------------------------------------------
///						　	初期化処理
/// -------------------------------------------------------------
void Collider::Initialize()
{

}


/// -------------------------------------------------------------
///						　	 更新処理
/// -------------------------------------------------------------
void Collider::Update()
{
	worldPosition_ = GetCenterPosition();
}


/// -------------------------------------------------------------
///						　	 描画処理
/// -------------------------------------------------------------
void Collider::Draw()
{
	Wireframe::GetInstance()->DrawSphere(worldPosition_, radius_, defaultColor_);
}
