#include "ContactRecord.h"
#include <algorithm>


/// -------------------------------------------------------------
///						履歴を追加する処理
/// -------------------------------------------------------------
void ContactRecord::Add(uint32_t number)
{
	// 履歴に登録
	record_.push_back(number);
}


/// -------------------------------------------------------------
///						履歴を確認する処理
/// -------------------------------------------------------------
bool ContactRecord::Check(uint32_t number)
{
	// 履歴があるか確認
	return std::any_of(record_.begin(), record_.end(), [number](uint32_t log) { return log == number; });
}


/// -------------------------------------------------------------
///						履歴を削除する処理
/// -------------------------------------------------------------
void ContactRecord::Crear()
{
	// 履歴を削除
	record_.clear();
}
