#include "ScoreManager.h"
#include <imgui.h>

/// -------------------------------------------------------------
///					シングルトンインスタンス取得
/// -------------------------------------------------------------
ScoreManager* ScoreManager::GetInstance()
{
	static ScoreManager instance;
	return &instance;
}

/// -------------------------------------------------------------
///						初期化処理
/// -------------------------------------------------------------
void ScoreManager::Initialize()
{
	// スコアとキル数をリセット
	Reset();
}

/// -------------------------------------------------------------
///						キル数の追加
/// -------------------------------------------------------------
void ScoreManager::AddKill()
{
	++kills_;
	AddScore(100); // 1体倒すごとに100点
}

/// -------------------------------------------------------------
///						スコアのリセット
/// -------------------------------------------------------------
void ScoreManager::Reset()
{
	score_ = 0;
	kills_ = 0;
}

/// -------------------------------------------------------------
///						ImGui描画処理
/// -------------------------------------------------------------
void ScoreManager::DrawImGui() const
{
	ImGui::Begin("Score");
	ImGui::Text("Score: %d", score_);
	ImGui::Text("Kills: %d", kills_);
	ImGui::End();
}
