#include "GameClearScene.h"
#include <DirectXCommon.h>
#include <Input.h>
#include <ParameterManager.h>
#include <ParticleManager.h>
#include <TextureManager.h>


/// -------------------------------------------------------------
///				　			初期化処理
/// -------------------------------------------------------------
void GameClearScene::Initialize()
{
	dxCommon_ = DirectXCommon::GetInstance();
	input = Input::GetInstance();
}


/// -------------------------------------------------------------
///				　			更新処理
/// -------------------------------------------------------------
void GameClearScene::Update()
{

}


/// -------------------------------------------------------------
///				　			3Dオブジェクトの描画
/// -------------------------------------------------------------
void GameClearScene::Draw3DObjects()
{

}


/// -------------------------------------------------------------
///				　			2Dオブジェクトの描画
/// -------------------------------------------------------------
void GameClearScene::Draw2DSprites()
{

}


/// -------------------------------------------------------------
///				　			終了処理
/// -------------------------------------------------------------
void GameClearScene::Finalize()
{
}


/// -------------------------------------------------------------
///				　		　ImGui描画処理
/// -------------------------------------------------------------
void GameClearScene::DrawImGui()
{
}
